app/controllers/games_controller.rb

  def create

    game_params = params["game"]
    game = Game.new(centre_lat:game_params["centre_lat"],
                     centre_lng:game_params["centre_lng"],
                     num_players:game_params["num_players"],
                     active: true)
    game.save
---
INSERT INTO "games" ("centre_lat", "centre_lng", "created_at", "num_players", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["centre_lat", "4431213.0"], ["centre_lng", "45464677.0"], ["created_at", "2014-09-26 06:32:40.485992"], ["num_players", 42], ["updated_at", "2014-09-26 06:32:40.485992"]]

  def show
    @game = Game.find(params[:id])
    @player = Player.create( game_id: params[:id],
                          lat: @game.get_random_lat,
                          lng: @game.get_random_lng,
                          kind: @game.mark_as_rabbit? )
---
SELECT  "games".* FROM "games"  WHERE "games"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "players" ("created_at", "game_id", "kind", "lat", "lng", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2014-09-26 06:12:38.120319"], ["game_id", 1], ["kind", "hunter"], ["lat", "-41.294947"], ["lng", "174.77291"], ["updated_at", "2014-09-26 06:12:38.120319"]]