app/controllers/player_controller.rb

UPDATE "games" SET "active" = $1, "updated_at" = $2 WHERE "games"."id" = 17  [["active", "f"], ["updated_at", "2014-09-26 23:29:35.729874"]]
---
	def update_player_position
    game_data = GameStatus.update(params)