app/controllers/player_controller.rb

SELECT  "players".* FROM "players"  WHERE "players"."id" = $1 LIMIT 1  [["id", 1]]
---
	def update_player_position
	  player = Player.find(params[id])