app/controllers/welcome_controller.rb

SELECT "games".* FROM "games"  WHERE (active = 'true')
---
	def index
    	@games = Game.where("active = ?", "true")